// Завдання:У цьому фрагменті коду є об'єкт product, який описує товар.

// Створи інтерфейс Product, який описує структуру цього об'єкта.
// Зроби поле id тільки для читання - воно не повинно змінюватись після створення об'єкта.
// Зроби поле description необов'язковим - не всі товари можуть його мати.
// Типізуй змінну product за допомогою створеного інтерфейсу.
// Залиш властивості обʼєкта product і їх значення без змін.

const product = {
  id: 1,
  title: "Tablet",
  description: "Compact and fast",
};

console.log(`Product: ${JSON.stringify(product)}`);
